In [ ]:
#importing Libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

#loading data 
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

#data cleanup

df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [2]:
# Retreiving the data of fisrt 10 rows of the columns from  'salary_year_avg'to 'salary_hour_avg'
df.loc[:10, 'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0               NaN              NaN
1               NaN              NaN
2               NaN              NaN
3               NaN              NaN
4               NaN              NaN
5               NaN              NaN
6               NaN              NaN
7               NaN              NaN
8               NaN              NaN
9               NaN              NaN
10              NaN              NaN

In [7]:
# Finding out the median value of the 'salary_year_avg' column and assigning a variable for it 
median_salary_year = df['salary_year_avg'].median()

In [6]:
# Finding out the median value of the 'salary_year_avg' column and assigning a variable for it 
median_salary_hour = df['salary_hour_avg'].median()

In [9]:
''' Creating a new dataframe as df_filled andvalues of the columns of 'salary_year_avg' & 'salary_hour_avg'  
with the median values of the respective columns''' filling the NAN 
df_filled = df

df_filled['salary_year_avg']= df_filled['salary_year_avg'].fillna(median_salary_year)

df_filled['salary_hour_avg']= df_filled['salary_hour_avg'].fillna(median_salary_hour)

In [10]:
# Confirmation of the valus entered as medians
df_filled.loc[:10, 'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

In [11]:
# Creating a new df as df_unique and dropping the duplicate records from the df_filled dataframe using drop_duplicate method
df_unique = df_filled
df_unique = df_unique.drop_duplicates()

print('Length of original df :    ', len(df_filled))
print('Length of drop duplicates df:   ', len(df_unique))
print('Rows Dropped:        ', len(df_filled)-len(df_unique))

Length of original df :     785741
Length of drop duplicates df:    785640
Rows Dropped:         101

In [12]:
df_unique = df_unique.drop_duplicates(subset =['job_title', 'company_name'])
print('Length of original df :    ', len(df_filled))
print('Length of drop duplicates df:   ', len(df_unique))
print('Rows Dropped:        ', len(df_filled)-len(df_unique))

Length of original df :     785741
Length of drop duplicates df:    508042
Rows Dropped:         277699